app/controllers/weapons_controller.rb

SELECT "weapons".* FROM "weapons"
---
  def index
    @weapons = Weapon.all

INSERT INTO "weapons" ("created_at", "updated_at", "weapon_def", "weapon_dmg", "weapon_name", "weapon_type") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @weapon = Weapon.new(weapon_params)

    respond_to do |format|
      if @weapon.save

SELECT "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_weapon
      @weapon = Weapon.find(params[:id])